Tekla Open API Reference for Tekla Structures 2025
BaseRebarGroup.SpacingType Property
 The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
SPACING_TYPE_EXACT_SPACE_FLEX_AT_MIDDLE
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseRebarGroup.RebarGroupSpacingTypeEnum SpacingType { get; set; }
Public Property SpacingType As BaseRebarGroup.RebarGroupSpacingTypeEnum
	Get
	Set
Property Value
Type: BaseRebarGroup.RebarGroupSpacingTypeEnum
See Also
Reference
BaseRebarGroup Class
Tekla.Structures.Model Namespace